Tekla Open API Reference for Tekla Structures 2025
CustomLineTypeCatalog Class
 The CustomLineTypeCatalog provides accessors to fetch the possible custom line types of drawing objects.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.CustomLineTypeCatalog
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static class CustomLineTypeCatalog
Public NotInheritable Class CustomLineTypeCatalog
Methods
Name | Description
Get()
 Gets all the available CustomLineType's.
Get(Int32)
 Gets the CustomLineType with the specified ID.
Get(String)
 Gets the CustomLineType with the specified Name.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace